/*
	AudioSystem.h
	20251001  hanaue sho
	音を鳴らす土台部分（ XAudio2 の起動＆終了）
	プログラム内で１つのみ生成
*/
#ifndef AUDIOSYSTEM_H_
#define AUDIOSYSTEM_H_
#include <xaudio2.h>
#include <wrl/client.h>

class AudioSystem
{
private:
	// ==================================================
	// 本体要素
	// ==================================================
	// --------------------------------------------------
	// XAudio2 本体
	// --------------------------------------------------
	static Microsoft::WRL::ComPtr<IXAudio2> s_Engine;
	// --------------------------------------------------
	// 出力ミキサ
	// --------------------------------------------------
	static IXAudio2MasteringVoice* s_Master; 
	static bool								s_Initialized;

public:
	// ==================================================
	// ライフサイクル
	// ==================================================
	// --------------------------------------------------
	// エンジン起動＆マスターボイス生成
	// Main関数内で１回だけ呼び出す
	// --------------------------------------------------
	static bool Init();
	// --------------------------------------------------
	// 破棄
	// --------------------------------------------------
	static void Shutdown();

	// ==================================================
	// 便利アクセサ
	// ==================================================
	static IXAudio2*			   GetEngine(); // 音をミキシングして出力する“音のOS”
	static IXAudio2MasteringVoice* GetMaster(); // 最終段の出力ミキサ。ここに全ての音が混ざり、OSの既定出力へ流れる

	// --------------------------------------------------
	// 全体音量（0.0f ~ 1.0f）
	// --------------------------------------------------
	static void  SetMasterVolume(float vol);
	static float GetMasterVolume();

	// --------------------------------------------------
	// アプリのサスペンド/レジューム等で使う
	// --------------------------------------------------
	static void Suspend(); // 一時停止
	static void Resume();  // 再開
};

#endif